r= int(input("소득입력(만원단위): "))

a=1200*0.06
b=3400*0.15
c=4200*0.24
d=6200*0.35

if r<1200:
   print("전체세금:",r*0.06)
   print("전체소득:",r-(r*0.06))
if 1200<r<4600:
   print("전체세금:",a+(r-1200)*0.15)
   print("전체소득:",r-(a+(r-1200)*0.15))
if 4600<r<8800:
   print("전체세금:",a+b+(r-4600)*0.24)
   print("전체소득:",r-(a+b+(r-4600)*0.24))
if 8800<r<15000:
   print("전체세금:",a+b+c+(r-8800)*0.35)
   print("전체소득:",r-(a+b+c+(r-8800)*0.35) )
if 15000<r:
   print("전체세금:",a+b+c+d+(r-15000)*0.38)
   print("전체소득:",r-(a+b+c+d+(r-15000)*0.38) ) 
